<template>
  <div class="single-blog-page mt-5">
    <section class="share-btn relative z-10">
            <div class="share-socials sticky">
        <ul class="share-menu absolute top-0 right-4">
          <li class="main-share">
            <a href="#">
              <span>
                <i class="fal fa-share-alt text-cool-500 text-lg p-0.5 "></i>
              </span>
            </a>
            <ul>
              <li>
                <a href="#">
                  <span>
                    <i class="fab fa-telegram-plane text-cool-500 text-lg p-0.5"></i>
                  </span>
                </a>
              </li>
              <li>
                <a href="#">
                  <span>
                    <i class="fab fa-twitter text-cool-500 text-lg p-0.5"></i>
                  </span>
                </a>
              </li>
              <li>
                <a href="#">
                  <span>
                    <i class="fab fa-instagram text-cool-500 text-lg p-0.5"></i>
                  </span>
                </a>
              </li>
              <li>
                <a href="#">
                  <span>
                    <i class="fab fa-linkedin-in text-cool-500 text-lg p-0.5"></i>
                  </span>
                </a>
              </li>
              <li>
                <a href="#">
                  <span>
                    <i class="fab fa-google-plus-g text-cool-500 text-lg p-0.5 "></i>
                  </span>
                </a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
    </section>
    <section class="landing-blog">
      <div class="container mx-auto">
        <div
          class="grid grid-cols-2 gap-30 border-cool-100 border rounded-lg overflow-hidden relative"
        >
          <div class="rightbox col-span-2 md:col-span-1 order-2 md:order-1 p-4">
            <div class="content-info">
              <div class="title-single md:mt-3">
                <h1 class="text-xl font-bold text-cool-600">
                  با اپلیکیشن گیلسا چگونه کار کنیم و همه چیز را مدیریت کنیم؟
                </h1>
              </div>
              <div class="breadcumb text-sm">
                <vs-breadcrumb color="#eee">
                  <li>
                    <a href="#" title="Home">صفحه اصلی</a
                    ><span class="vs-breadcrum--separator">/</span>
                  </li>
                  <li>
                    <a href="#" title="blogcat">دانشنامه</a
                    >
                  </li>
                </vs-breadcrumb>
              </div>
              <div
                class="des-single mt-3 text-sm text-cool-600 h-28 overflow-hidden"
              >
                در این مکان خلاصه و چکیده مطلب شما در حد چند خط قرار میگیرد لورم
                ایپسوم متن ساختگی با تولید سادگینامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
              </div>
              <div class="info-box bg-cool-100 p-2 mt-5 rounded-lg ">
                <figure class=" text-cool-400 my-auto inline-block ml-6">
                  <i class="fal fa-folder-open text-2xl ml-2"></i>
                  <span class="text-sm font-thin relative -top-1"
                    >دانشنامه</span
                  >
                </figure>
                <figure class=" text-cool-400 my-auto inline-block ml-6">
                  <i class="fal fa-calendar-edit text-2xl ml-2"></i>
                  <span class="text-sm font-thin relative -top-1"
                    >تاریخ انتشار : 20 آبان 99</span
                  >
                </figure>
                <figure class=" text-cool-400 my-auto inline-block ml-6">
                  <i class="fal fa-eye text-2xl ml-2"></i>
                  <span class="text-sm font-thin relative -top-1"
                    >20 بازدید</span
                  >
                </figure>
              </div>
            </div>
          </div>
          <div class="dynamic-img col-span-2 h-56 md:h-auto md:col-span-1 order-1 md:order-2 overflow-hidden relative"></div>
        </div>
      </div>
    </section>
    <section class="row-content mt-5">
      <div class="container mx-auto">
        <div class="grid grid-cols-12 md:gap-4 lg:gap-30">
          <div
            class="col-span-12 md:col-span-9 "
          >
          <div class="content-box p-4 rounded-lg border border-cool-100 text-cool-600 font-normal text-sm md:text-base">
            <p>
              در این مکان مطلب شما در اینجا به صورت کامل قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد در این مکان خلاصه و چکیده مطلب شما در حد چند
              خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
              صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
              روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
              تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
              کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
              شناخت فراوان جامعه و.متخصصان را می طلبد در این مکان خلاصه و چکیده
              مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید
              سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم
              است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با
              هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
              گذشته حال و آینده، شناخت فراوان جامعه و.متخصصان را می طلبد در این
              مکان خلاصه و چکیده مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد
            </p>
            <p>
              در این مکان مطلب شما در اینجا به صورت کامل قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد در این مکان خلاصه و چکیده مطلب شما در حد چند
              خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
              صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
              روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
              تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
              کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
              شناخت فراوان جامعه و.متخصصان را می طلبد در این مکان خلاصه و چکیده
              مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید
              سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم
              است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با
              هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
              گذشته حال و آینده، شناخت فراوان جامعه و.متخصصان را می طلبد در این
              مکان خلاصه و چکیده مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد
            </p>
            <p>
              در این مکان مطلب شما در اینجا به صورت کامل قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد در این مکان خلاصه و چکیده مطلب شما در حد چند
              خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
              صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
              روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
              تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
              کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
              شناخت فراوان جامعه و.متخصصان را می طلبد در این مکان خلاصه و چکیده
              مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم متن ساختگی با تولید
              سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم
              است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با
              هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
              گذشته حال و آینده، شناخت فراوان جامعه و.متخصصان را می طلبد در این
              مکان خلاصه و چکیده مطلب شما در حد چند خط قرار میگیرد لورم ایپسوم
              متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
              طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
              سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
              زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه
              و.متخصصان را می طلبد
            </p>
          </div>
          <div class="btntocomment mt-5 text-center">
            <vs-button color="#4B5563" type="border">در بحث و گفتگو در رابطه با این مطلب شرکت کنید</vs-button>
          </div>
          </div>
          <sideblog></sideblog>
        </div>
      </div>
    </section>
    <section class="title-section mt-24 mb-8 relative">
      <div class="container mx-auto">
        <div class=" grid grid-cols-2 gap-30">
          <div class="col-span-2">
            <h3
              class="title-border relative text-xl font-black text-cool-800 inline-block border-b-2 border-cool-600 pb-2 pl-5 "
            >
              مطالب مرتبط
            </h3>
          </div>
        </div>
      </div>
    </section>
        <singleblog :singleblogprops="blogarray"/>
    <section class="title-section mt-24 mb-3 relative">
      <div class="container mx-auto">
        <div class="grid grid-cols-2 gap-30">
          <div class="col-span-2">
            <h3
              class="title-border relative text-xl font-black text-cool-800 inline-block border-b-2 border-cool-600 pb-2 pl-5 "
            >
              نظرات شما
            </h3>
          </div>
        </div>
      </div>
    </section>
    <comment></comment>
  </div>
</template>
<script>
import singleblog from "../../components/blog/single-blog.vue";
import comment from "../../components/comment.vue";
import sideblog from "../../components/side-blog.vue";
  export default {
    data() {
      return{
        blogarray:[
          { img: require('@/assets/img/product/02.png') ,title:"  ۰ تا ۱۰۰ آموزش کسب و کار اینترنتی، دوره جامع وبمستران هوشمند " ,href:"#" ,desc:" آموزش جامع ساخت و مدیریت کسب و کار اینترنتی، اصول بازاریابی و رساندن سایت و "},
          { img: require('@/assets/img/product/03.png') ,title:"  ۰ تا ۱۰۰ آموزش کسب و کار اینترنتی، دوره جامع وبمستران هوشمند " ,href:"#" ,desc:" آموزش جامع ساخت و مدیریت کسب و کار اینترنتی، اصول بازاریابی و رساندن سایت و "},
          { img: require('@/assets/img/product/04.png') ,title:"  ۰ تا ۱۰۰ آموزش کسب و کار اینترنتی، دوره جامع وبمستران هوشمند " ,href:"#" ,desc:" آموزش جامع ساخت و مدیریت کسب و کار اینترنتی، اصول بازاریابی و رساندن سایت و "},
          { img: require('@/assets/img/product/03.png') ,title:"  ۰ تا ۱۰۰ آموزش کسب و کار اینترنتی، دوره جامع وبمستران هوشمند " ,href:"#" ,desc:" آموزش جامع ساخت و مدیریت کسب و کار اینترنتی، اصول بازاریابی و رساندن سایت و "},
        ],
        value1: "",
      }
    },
    components:{
      singleblog,
      comment,
      sideblog,
    }
  }

</script>
